Revit 2026 API

# ColorFillSchemeIsValidSchemeName Method

---

Checks whether the name is valid for new generated scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidSchemeName(
	string name
)
```
```vb
Public Function IsValidSchemeName (
	name As String
) As Boolean
```
```cpp
public:
bool IsValidSchemeName(
	String^ name
)
```
```fsharp
member IsValidSchemeName :
        name : string -> bool
```

#### Parameters

name String

#### Return Value

Boolean Returns true if the name is valid for new generated scheme, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The name should not be empty, or all spaces, or include prohibited characters or duplicated with existing schemes.

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace